/**
 *  Примеры слов в словаре
 */

{
	"Какой-то глагол": {
		"type": "action",
		"like": {
			"Синоним": 0.2 // Схожесть
		},
		"style": 0, // Стиль. 1 - разговорный, 0 - универсальный, -1 - официальный
	}
}

/**
 *  Расширенный вариант.
 *  Храним основы слов, суффиксы, префиксы и окончания отдельно
 *  В реальности тупо не проканает, годно только для Эсперанто, где пре- и постфиксы 
 *    имеют фиксированное значение.
 */

// Префиксы aka приставки
{
	"пере": {
		
	}
}



/**
 *  Примеры обработки предложений
 */

"Мама мыла раму" ->
[
	{
		"type": "object",
		"root": "мама",
		"refs": [
			{
				"type": "action",
				"root": "мыть",
				"refs": [
					{
						"type": "object",
						"root": "рама"
					}
				]
			}
		]
	}
]

"Я прогал на фортране, норм язык для разминки мозгов" ->
[
	{
		"type": "object",
		"root": "я",
		"refs": [
			{
				"type": "action",
				"root": "программировать",
				"style": 1 // неофициально. 
				"refs": [
					{
						"type": "tool",
						"root": "Фортран",
						"refs": [
							{
								"type": "sub",
								"root": "язык",
								"refs": [
									{
										"type": "description",
										"root": "нормальный",
										"style": 1,
									},
									{
										"type": "target",
										"root": "разминка",
										"refs": [
											{
												"type": "target",
												"root": "мозг",
												"multiple": true
											}
										]
									}
								]
							},
						]
					}
				]
			}
		]
	}
]